name: "whisper_base"
backend: "python"

input [
  {
    name: "audio"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "transcription"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
  }
]
